## **Introduction to Pandas**

> It is often said that 80% of data analysis is spent on the data cleaning and preparing data. To get a handle on the problem, this article will focus on a small but important aspect of data manipulation and cleaning with Pandas.

### **Data Structures in Pandas**

There are two data structures are there in Pandas -<br>
* **Series -** It is one-dimensional labeled array capable of holding any datatype (integer, strings, floating point numbers, Python objects etc).<br>
* **Data Frame -** It is a two-dimensional labeled data structure with columns of potemtially different datatypes. We can think of it like a spreadsheet or SQL Table or a Series of objects.

### **Series Data Structure:**

**pandas.core.series.Series(data, index, dtype, copy)**

* **data -** data takes various forms like ndarray, list, constants, dictionary etc.<br>
* **index -** it is unique and hashable for easy identification<br>
* **dtype -** it is for the data type<br>
* **copy -** copy data, and its default value is False. It only affects for Series or one dimensional ndarray inputs

In [1]:
# importing the required modules
import numpy as np
import pandas as pd

In [3]:
# create an empty Series
import warnings
warnings.filterwarnings('ignore')
s = pd.Series()
print (s, type(s))

Series([], dtype: float64) <class 'pandas.core.series.Series'>

In [6]:
# create a Series from a ndarray
arr_data = np.array(['apple', 'guava', 'banana', 'pineapple', 'coconut'])
s = pd.Series(data = arr_data)
print (s, type(s))
print (s[0], s[1], s[4])

0        apple
1        guava
2       banana
3    pineapple
4      coconut
dtype: object <class 'pandas.core.series.Series'>
apple guava coconut

In [7]:
arr_data = np.array([100, 400, 500, 200, 700])
s = pd.Series(data = arr_data)
print (s, type(s))
print (s[0], s[1], s[4])

0    100
1    400
2    500
3    200
4    700
dtype: int32 <class 'pandas.core.series.Series'>
100 400 700

In [8]:
arr_data = np.array([100, 400, 500, True, 200, False, 700])
s = pd.Series(data = arr_data)
print (s, type(s))
print (s[0], s[1], s[4])

0    100
1    400
2    500
3      1
4    200
5      0
6    700
dtype: int32 <class 'pandas.core.series.Series'>
100 400 200

In [9]:
arr_data = np.array([100., 400, 500, True, 200, False, 700])
s = pd.Series(data = arr_data)
print (s, type(s))
print (s[0], s[1], s[4])

0    100.0
1    400.0
2    500.0
3      1.0
4    200.0
5      0.0
6    700.0
dtype: float64 <class 'pandas.core.series.Series'>
100.0 400.0 200.0

In [10]:
arr_data = np.array([100., 400, 500, True, 200, False, 700, 'Amit'])
s = pd.Series(data = arr_data)
print (s, type(s))
print (s[0], s[1], s[4])

0    100.0
1      400
2      500
3     True
4      200
5    False
6      700
7     Amit
dtype: object <class 'pandas.core.series.Series'>
100.0 400 200

In [13]:
arr_data = np.array([100, 400, 500, 200, 700])
s = pd.Series(data = arr_data)
print (arr_data, type(arr_data))
print (s, type(s))

arr_data[2] = 50000
s[1] = 40000
print (arr_data, type(arr_data))
print (s, type(s))

[100 400 500 200 700] <class 'numpy.ndarray'>
0    100
1    400
2    500
3    200
4    700
dtype: int32 <class 'pandas.core.series.Series'>
[  100 40000 50000   200   700] <class 'numpy.ndarray'>
0      100
1    40000
2    50000
3      200
4      700
dtype: int32 <class 'pandas.core.series.Series'>

In [14]:
arr_data = np.array([100, 400, 500, 200, 700])
s = pd.Series(data = arr_data, copy=False)
print (arr_data, type(arr_data))
print (s, type(s))

arr_data[2] = 50000
s[1] = 40000
print (arr_data, type(arr_data))
print (s, type(s))

[100 400 500 200 700] <class 'numpy.ndarray'>
0    100
1    400
2    500
3    200
4    700
dtype: int32 <class 'pandas.core.series.Series'>
[  100 40000 50000   200   700] <class 'numpy.ndarray'>
0      100
1    40000
2    50000
3      200
4      700
dtype: int32 <class 'pandas.core.series.Series'>

In [15]:
arr_data = np.array([100, 400, 500, 200, 700])
s = pd.Series(data = arr_data, copy=True)
print (arr_data, type(arr_data))
print (s, type(s))

arr_data[2] = 50000
s[1] = 40000
print (arr_data, type(arr_data))
print (s, type(s))

[100 400 500 200 700] <class 'numpy.ndarray'>
0    100
1    400
2    500
3    200
4    700
dtype: int32 <class 'pandas.core.series.Series'>
[  100   400 50000   200   700] <class 'numpy.ndarray'>
0      100
1    40000
2      500
3      200
4      700
dtype: int32 <class 'pandas.core.series.Series'>

In [28]:
arr_data = np.array(['apple', 'guava', 'banana', 'pineapple', 'coconut'])
print (arr_data, type(arr_data))

s = pd.Series(arr_data)
print (s, type(s), s[1], s[3])

s = pd.Series(arr_data, index = [100, 101, 102, 103, 104])
print (s, type(s), s[101], s[103])

s = pd.Series(arr_data, index = [105, 101, 103, 101, 103])
print (s, type(s))
print (s[101])
print (s[103])

['apple' 'guava' 'banana' 'pineapple' 'coconut'] <class 'numpy.ndarray'>
0        apple
1        guava
2       banana
3    pineapple
4      coconut
dtype: object <class 'pandas.core.series.Series'> guava pineapple
100        apple
101        guava
102       banana
103    pineapple
104      coconut
dtype: object <class 'pandas.core.series.Series'> guava pineapple
105        apple
101        guava
103       banana
101    pineapple
103      coconut
dtype: object <class 'pandas.core.series.Series'>
101        guava
101    pineapple
dtype: object
103     banana
103    coconut
dtype: object

In [29]:
arr_data = np.array(['apple', 'guava', 'banana', 'pineapple', 'coconut'])
print (arr_data, type(arr_data))

s = pd.Series(arr_data, index = ['fruit-1', 'fruit-2', 'fruit-3', 'fruit-4', 'fruit-5'])
print (s, type(s))
print (s['fruit-1'], s['fruit-3'])
print (s[0], s[2], s[1])

['apple' 'guava' 'banana' 'pineapple' 'coconut'] <class 'numpy.ndarray'>
fruit-1        apple
fruit-2        guava
fruit-3       banana
fruit-4    pineapple
fruit-5      coconut
dtype: object <class 'pandas.core.series.Series'>
apple banana
apple banana guava

In [31]:
# create a Series from a dictionary
dict_data = {'apple':100, 'banana':202, 'coconut':301, 'mango':709}
s = pd.Series(data = dict_data)
print (s, type(s))
print (s['banana'], s['mango'])

apple      100
banana     202
coconut    301
mango      709
dtype: int64 <class 'pandas.core.series.Series'>
202 709

In [33]:
dict_data = {'apple':100, 'banana':202, 'coconut':301, 'mango':709}
s = pd.Series(data = dict_data, index = ['coconut', 'apple', 'mango', 'coconut', 'mango', 'coconut', 'banana', 'lime'])
print (s, type(s))
print (s['banana'], s['mango'])

coconut    301.0
apple      100.0
mango      709.0
coconut    301.0
mango      709.0
coconut    301.0
banana     202.0
lime         NaN
dtype: float64 <class 'pandas.core.series.Series'>
202.0 mango    709.0
mango    709.0
dtype: float64

In [34]:
# create a Series from a scalar
s = pd.Series(5, index = [0, 1, 2, 3, 4, 5, 6, 7])
print (s, type(s))

0    5
1    5
2    5
3    5
4    5
5    5
6    5
7    5
dtype: int64 <class 'pandas.core.series.Series'>

In [36]:
# create a Series from a list
list_data = [101, 303, 202, 505, 404]
s = pd.Series(data = list_data, index = ['red', 'blue', 'purple', 'white', 'brown'])
print (s, type(s))

red       101
blue      303
purple    202
white     505
brown     404
dtype: int64 <class 'pandas.core.series.Series'>

### **Data Frame Data Structure:**

In [1]:
import pandas as pd

In [2]:
user_data = [['alice', 19, 'F', 'student'], ['john', 26, 'M', 'student']]
user_columns = ['name', 'age', 'gender', 'job']
user1 = pd.DataFrame(data = user_data, columns = user_columns)
user1

    name  age gender      job
0  alice   19      F  student
1   john   26      M  student

In [3]:
user_data = dict(name = ['eric', 'paul'], age = [22, 58], gender = ['M', 'F'], job = ['student', 'manager'])
print (user_data, type(user_data))
user2 = pd.DataFrame(data = user_data)
user2

{'name': ['eric', 'paul'], 'age': [22, 58], 'gender': ['M', 'F'], 'job': ['student', 'manager']} <class 'dict'>

   name  age gender      job
0  eric   22      M  student
1  paul   58      F  manager

In [4]:
user_data = {'name': ['peter', 'julie'], 'age': [33, 44], 'gender': ['M', 'F'], 'job': ['engineer', 'scientist']}
print (user_data, type(user_data))
user3 = pd.DataFrame(data = user_data)
user3

{'name': ['peter', 'julie'], 'age': [33, 44], 'gender': ['M', 'F'], 'job': ['engineer', 'scientist']} <class 'dict'>

    name  age gender        job
0  peter   33      M   engineer
1  julie   44      F  scientist

### Concatenate DataFrame

In [5]:
users = user1.append(user2)
users

<ipython-input-5-a2754179f705>:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  users = user1.append(user2)

    name  age gender      job
0  alice   19      F  student
1   john   26      M  student
0   eric   22      M  student
1   paul   58      F  manager

In [6]:
users = user1.append(user2, ignore_index=True)
users

<ipython-input-6-aee736150dab>:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  users = user1.append(user2, ignore_index=True)

    name  age gender      job
0  alice   19      F  student
1   john   26      M  student
2   eric   22      M  student
3   paul   58      F  manager

In [7]:
users = users.append(user3, ignore_index=True)
users

<ipython-input-7-d05a3fcab511>:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  users = users.append(user3, ignore_index=True)

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [8]:
users = user1.append(user2).append(user3, ignore_index=True)
users

<ipython-input-8-aa627bdfaf05>:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  users = user1.append(user2).append(user3, ignore_index=True)

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [9]:
users = pd.concat([user1, user2, user3])
users

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
0   eric   22      M    student
1   paul   58      F    manager
0  peter   33      M   engineer
1  julie   44      F  scientist

In [10]:
users = pd.concat([user1, user2, user3], ignore_index=True)
users

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [36]:
# DataFrame to NumPy
arr_data = user1['name'].to_numpy()
print (arr_data, type(arr_data))

['alice' 'john'] <class 'numpy.ndarray'>

In [37]:
arr_data = user1.to_numpy()
print (arr_data, type(arr_data))

[['alice' 19 'F' 'student']
 ['john' 26 'M' 'student']] <class 'numpy.ndarray'>

In [38]:
import numpy as np
arr_data = np.array(user1)
print (arr_data, type(arr_data))

[['alice' 19 'F' 'student']
 ['john' 26 'M' 'student']] <class 'numpy.ndarray'>

### Join DataFrame

In [11]:
dict_data = dict(name = ['alice', 'john', 'eric', 'julie', 'anderson'], height = [165, 180, 175, 169, 170])
user4 = pd.DataFrame(data = dict_data)
user4

       name  height
0     alice     165
1      john     180
2      eric     175
3     julie     169
4  anderson     170

In [12]:
users

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [13]:
# inner join: all common rows from both data frames
merge_inner = pd.merge(users, user4, on = "name", how = "inner")
merge_inner

    name  age gender        job  height
0  alice   19      F    student     165
1   john   26      M    student     180
2   eric   22      M    student     175
3  julie   44      F  scientist     169

In [14]:
# outer join: all rows from both data frames
merge_outer = pd.merge(users, user4, on = "name", how = "outer")
merge_outer

       name   age gender        job  height
0     alice  19.0      F    student   165.0
1      john  26.0      M    student   180.0
2      eric  22.0      M    student   175.0
3      paul  58.0      F    manager     NaN
4     peter  33.0      M   engineer     NaN
5     julie  44.0      F  scientist   169.0
6  anderson   NaN    NaN        NaN   170.0

In [93]:
# left outer join: all rows from the left dataframe and common rows from the right dataframe
merge_left = pd.merge(users, user4, on = "name", how = "left")
merge_left

    name  age gender        job  height
0  alice   19      F    student   165.0
1   john   26      M    student   180.0
2   eric   22      M    student   175.0
3   paul   58      F    manager     NaN
4  peter   33      M   engineer     NaN
5  julie   44      F  scientist   169.0

In [16]:
# right outer join: common rows from the left dataframe and all rows from the right dataframe
merge_right = pd.merge(users, user4, on = "name", how = "right")
merge_right

       name   age gender        job  height
0     alice  19.0      F    student     165
1      john  26.0      M    student     180
2      eric  22.0      M    student     175
3     julie  44.0      F  scientist     169
4  anderson   NaN    NaN        NaN     170

### Summarizing

In [91]:
print (type(users))
print (users.index)
print (users.columns)
print (users.shape, users.shape[0], users.shape[1])
print (users.values, type(users.values))
print (users.dtypes, type(users.dtypes))
users

<class 'pandas.core.frame.DataFrame'>
RangeIndex(start=0, stop=6, step=1)
Index(['name', 'age', 'gender', 'job'], dtype='object')
(6, 4) 6 4
[['alice' 19 'F' 'student']
 ['john' 26 'M' 'student']
 ['eric' 22 'M' 'student']
 ['paul' 58 'F' 'manager']
 ['peter' 33 'M' 'engineer']
 ['julie' 44 'F' 'scientist']] <class 'numpy.ndarray'>
name      object
age        int64
gender    object
job       object
dtype: object <class 'pandas.core.series.Series'>

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [84]:
users.head()

    name  age gender       job
0  alice   19      F   student
1   john   26      M   student
2   eric   22      M   student
3   paul   58      F   manager
4  peter   33      M  engineer

In [46]:
users.head(3)

    name  age gender      job
0  alice   19      F  student
1   john   26      M  student
2   eric   22      M  student

In [47]:
users.tail()

    name  age gender        job
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [48]:
users.tail(3)

    name  age gender        job
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [62]:
users.sample()

    name  age gender      job
0  alice   19      F  student

In [73]:
users.sample(3)

    name  age gender       job
4  peter   33      M  engineer
1   john   26      M   student
3   paul   58      F   manager

In [81]:
users.any()

name      True
age       True
gender    True
job       True
dtype: bool

In [92]:
users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    6 non-null      object
 1   age     6 non-null      int64
 2   gender  6 non-null      object
 3   job     6 non-null      object
dtypes: int64(1), object(3)
memory usage: 320.0+ bytes

In [93]:
users.describe()

             age
count   6.000000
mean   33.666667
std    14.895189
min    19.000000
25%    23.000000
50%    29.500000
75%    41.250000
max    58.000000

In [94]:
users.describe(include = ['object'])

         name gender      job
count       6      6        6
unique      6      2        4
top     alice      F  student
freq        1      3        3

In [98]:
users.describe(include = 'all')

         name        age gender      job
count       6   6.000000      6        6
unique      6        NaN      2        4
top     alice        NaN      F  student
freq        1        NaN      3        3
mean      NaN  33.666667    NaN      NaN
std       NaN  14.895189    NaN      NaN
min       NaN  19.000000    NaN      NaN
25%       NaN  23.000000    NaN      NaN
50%       NaN  29.500000    NaN      NaN
75%       NaN  41.250000    NaN      NaN
max       NaN  58.000000    NaN      NaN

### Column Selection

In [99]:
users

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [103]:
print (users.name)
print (users.age)
print (users['name'])

0    alice
1     john
2     eric
3     paul
4    peter
5    julie
Name: name, dtype: object
0    19
1    26
2    22
3    58
4    33
5    44
Name: age, dtype: int64
0    alice
1     john
2     eric
3     paul
4    peter
5    julie
Name: name, dtype: object

In [105]:
users[['gender', 'age', 'name']]

  gender  age   name
0      F   19  alice
1      M   26   john
2      M   22   eric
3      F   58   paul
4      M   33  peter
5      F   44  julie

In [106]:
my_cols = ['gender', 'age', 'name']
users[my_cols]

  gender  age   name
0      F   19  alice
1      M   26   john
2      M   22   eric
3      F   58   paul
4      M   33  peter
5      F   44  julie

In [108]:
users

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [111]:
print (users.iloc[3], type(users.iloc[3]))
print (users.loc[3], type(users.iloc[3]))

name         paul
age            58
gender          F
job       manager
Name: 3, dtype: object <class 'pandas.core.series.Series'>
name         paul
age            58
gender          F
job       manager
Name: 3, dtype: object <class 'pandas.core.series.Series'>

In [119]:
print (users.iloc[4][3], users.iloc[4]['job'], users.loc[4][3], users.loc[4]['job'])
print (users.iloc[4, 3], users.iloc[4]['job'], users.loc[4][3], users.loc[4, 'job'])

engineer engineer engineer engineer
engineer engineer engineer engineer

### Row Selection and Filtering

In [17]:
users

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [18]:
users.age

0    19
1    26
2    22
3    58
4    33
5    44
Name: age, dtype: int64

In [19]:
users.age < 40

0     True
1     True
2     True
3    False
4     True
5    False
Name: age, dtype: bool

In [20]:
users[users.age < 40]

    name  age gender       job
0  alice   19      F   student
1   john   26      M   student
2   eric   22      M   student
4  peter   33      M  engineer

In [21]:
users[users.age < 40].name

0    alice
1     john
2     eric
4    peter
Name: name, dtype: object

In [22]:
users[users.age < 40]["name"]

0    alice
1     john
2     eric
4    peter
Name: name, dtype: object

In [23]:
users[users.age < 40][["job", "name"]]

        job   name
0   student  alice
1   student   john
2   student   eric
4  engineer  peter

In [24]:
users

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [26]:
(users.age > 30) & (users.gender == 'F')

0    False
1    False
2    False
3     True
4    False
5     True
dtype: bool

In [27]:
users[(users.age > 30) & (users.gender == 'F')]

    name  age gender        job
3   paul   58      F    manager
5  julie   44      F  scientist

In [28]:
users[(users.age > 30) & (users.gender == 'F')][['gender','name','job']]

  gender   name        job
3      F   paul    manager
5      F  julie  scientist

In [30]:
users[(users.job == 'engineer') | (users.job == 'student')]

    name  age gender       job
0  alice   19      F   student
1   john   26      M   student
2   eric   22      M   student
4  peter   33      M  engineer

In [31]:
users[(users.job == 'engineer') | (users.job == 'student')][['gender','age','job']]

  gender  age       job
0      F   19   student
1      M   26   student
2      M   22   student
4      M   33  engineer

In [33]:
users[users.job.isin(['engineer','student'])]

    name  age gender       job
0  alice   19      F   student
1   john   26      M   student
2   eric   22      M   student
4  peter   33      M  engineer

### Sorting

In [34]:
df = users.copy()
df

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [38]:
print (df.age.sort_values())
print (df["age"].sort_values())

0    19
2    22
1    26
4    33
5    44
3    58
Name: age, dtype: int64
0    19
2    22
1    26
4    33
5    44
3    58
Name: age, dtype: int64

In [39]:
print (df.sort_values(by='age'))

    name  age gender        job
0  alice   19      F    student
2   eric   22      M    student
1   john   26      M    student
4  peter   33      M   engineer
5  julie   44      F  scientist
3   paul   58      F    manager

In [40]:
print (df.sort_values(by='age', ascending=False))

    name  age gender        job
3   paul   58      F    manager
5  julie   44      F  scientist
4  peter   33      M   engineer
1   john   26      M    student
2   eric   22      M    student
0  alice   19      F    student

In [43]:
df

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [45]:
df.sort_values(by='age', ascending=False, inplace=True)

In [46]:
df

    name  age gender        job
3   paul   58      F    manager
5  julie   44      F  scientist
4  peter   33      M   engineer
1   john   26      M    student
2   eric   22      M    student
0  alice   19      F    student

In [47]:
df = users.copy()
df.sort_values(by = ['gender','job','age'], inplace=True)

In [48]:
df

    name  age gender        job
3   paul   58      F    manager
5  julie   44      F  scientist
0  alice   19      F    student
4  peter   33      M   engineer
2   eric   22      M    student
1   john   26      M    student

### Quality Control: Duplicate Data

In [64]:
df = users.copy()
df = df.append(df.iloc[0])
df = df.append(df.iloc[2])
df = df.append(df.iloc[4])
df = df.append(df.iloc[3], ignore_index=True)
df

<ipython-input-64-9f32a29b1edf>:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(df.iloc[0])
<ipython-input-64-9f32a29b1edf>:3: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(df.iloc[2])
<ipython-input-64-9f32a29b1edf>:4: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(df.iloc[4])
<ipython-input-64-9f32a29b1edf>:5: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(df.iloc[3], ignore_index=True)

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist
6  alice   19      F    student
7   eric   22      M    student
8  peter   33      M   engineer
9   paul   58      F    manager

In [67]:
df.sort_values(by='name', inplace=True, ignore_index=True)
df

    name  age gender        job
0  alice   19      F    student
1  alice   19      F    student
2   eric   22      M    student
3   eric   22      M    student
4   john   26      M    student
5  julie   44      F  scientist
6   paul   58      F    manager
7   paul   58      F    manager
8  peter   33      M   engineer
9  peter   33      M   engineer

In [75]:
print (df.duplicated())
print (sum(df.duplicated()))
print (~df.duplicated())
print (sum(~df.duplicated()))
print (not True, not False)

0    False
1     True
2    False
3     True
4    False
5    False
6    False
7     True
8    False
9     True
dtype: bool
4
0     True
1    False
2     True
3    False
4     True
5     True
6     True
7    False
8     True
9    False
dtype: bool
6
False True

In [78]:
print (df.job.duplicated())
print (df.job.duplicated().sum())

0    False
1     True
2     True
3     True
4     True
5    False
6    False
7     True
8    False
9     True
Name: job, dtype: bool
6

In [81]:
df.drop_duplicates(inplace=True, ignore_index=True)
df

    name  age gender        job
0  alice   19      F    student
1   eric   22      M    student
2   john   26      M    student
3  julie   44      F  scientist
4   paul   58      F    manager
5  peter   33      M   engineer

### Quality Control: Missing Data

In [96]:
df = merge_left.copy()
df

    name  age gender        job  height
0  alice   19      F    student   165.0
1   john   26      M    student   180.0
2   eric   22      M    student   175.0
3   paul   58      F    manager     NaN
4  peter   33      M   engineer     NaN
5  julie   44      F  scientist   169.0

In [97]:
df.describe()

             age      height
count   6.000000    4.000000
mean   33.666667  172.250000
std    14.895189    6.601767
min    19.000000  165.000000
25%    23.000000  168.000000
50%    29.500000  172.000000
75%    41.250000  176.250000
max    58.000000  180.000000

In [98]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    6 non-null      object
 1   age     6 non-null      int64
 2   gender  6 non-null      object
 3   job     6 non-null      object
 4   height  4 non-null      float64
dtypes: float64(1), int64(1), object(3)
memory usage: 288.0+ bytes

In [105]:
print (df.height)
print (df.height.isnull())
print (df.height.isnull().sum())
print (df.height.notnull())
print (df.height.notnull().sum())

0    165.0
1    180.0
2    175.0
3      NaN
4      NaN
5    169.0
Name: height, dtype: float64
0    False
1    False
2    False
3     True
4     True
5    False
Name: height, dtype: bool
2
0     True
1     True
2     True
3    False
4    False
5     True
Name: height, dtype: bool
4

In [109]:
df.isnull()

    name    age  gender    job  height
0  False  False   False  False   False
1  False  False   False  False   False
2  False  False   False  False   False
3  False  False   False  False    True
4  False  False   False  False    True
5  False  False   False  False   False

In [110]:
~df.isnull()

   name   age  gender   job  height
0  True  True    True  True    True
1  True  True    True  True    True
2  True  True    True  True    True
3  True  True    True  True   False
4  True  True    True  True   False
5  True  True    True  True    True

In [107]:
df.notnull()

   name   age  gender   job  height
0  True  True    True  True    True
1  True  True    True  True    True
2  True  True    True  True    True
3  True  True    True  True   False
4  True  True    True  True   False
5  True  True    True  True    True

In [111]:
~df.notnull()

    name    age  gender    job  height
0  False  False   False  False   False
1  False  False   False  False   False
2  False  False   False  False   False
3  False  False   False  False    True
4  False  False   False  False    True
5  False  False   False  False   False

In [113]:
df[df.height.isnull()]

    name  age gender       job  height
3   paul   58      F   manager     NaN
4  peter   33      M  engineer     NaN

In [114]:
df[df.height.notnull()]

    name  age gender        job  height
0  alice   19      F    student   165.0
1   john   26      M    student   180.0
2   eric   22      M    student   175.0
5  julie   44      F  scientist   169.0

In [115]:
df[df["height"].notnull()]

    name  age gender        job  height
0  alice   19      F    student   165.0
1   john   26      M    student   180.0
2   eric   22      M    student   175.0
5  julie   44      F  scientist   169.0

In [117]:
# Strategy-1: (Deleting rows containing missing values)
df = merge_outer.copy()
df

       name   age gender        job  height
0     alice  19.0      F    student   165.0
1      john  26.0      M    student   180.0
2      eric  22.0      M    student   175.0
3      paul  58.0      F    manager     NaN
4     peter  33.0      M   engineer     NaN
5     julie  44.0      F  scientist   169.0
6  anderson   NaN    NaN        NaN   170.0

In [120]:
# df = df.dropna()
df.dropna(inplace=True)

In [121]:
df

    name   age gender        job  height
0  alice  19.0      F    student   165.0
1   john  26.0      M    student   180.0
2   eric  22.0      M    student   175.0
5  julie  44.0      F  scientist   169.0

In [122]:
df = merge_outer.copy()
df.dropna(how = "all", inplace = True)
df

       name   age gender        job  height
0     alice  19.0      F    student   165.0
1      john  26.0      M    student   180.0
2      eric  22.0      M    student   175.0
3      paul  58.0      F    manager     NaN
4     peter  33.0      M   engineer     NaN
5     julie  44.0      F  scientist   169.0
6  anderson   NaN    NaN        NaN   170.0

In [131]:
# Strategy-2: (Filling up missing values)
df = merge_left.copy()
df

    name  age gender        job  height
0  alice   19      F    student   165.0
1   john   26      M    student   180.0
2   eric   22      M    student   175.0
3   paul   58      F    manager     NaN
4  peter   33      M   engineer     NaN
5  julie   44      F  scientist   169.0

In [132]:
df.fillna(0, inplace=True)
df

    name  age gender        job  height
0  alice   19      F    student   165.0
1   john   26      M    student   180.0
2   eric   22      M    student   175.0
3   paul   58      F    manager     0.0
4  peter   33      M   engineer     0.0
5  julie   44      F  scientist   169.0

In [135]:
df = merge_left.copy()
df

    name  age gender        job  height
0  alice   19      F    student   165.0
1   john   26      M    student   180.0
2   eric   22      M    student   175.0
3   paul   58      F    manager     NaN
4  peter   33      M   engineer     NaN
5  julie   44      F  scientist   169.0

In [136]:
mean_height = df.height.mean()
print (mean_height)
df.fillna(mean_height, inplace=True)
df

172.25

    name  age gender        job  height
0  alice   19      F    student  165.00
1   john   26      M    student  180.00
2   eric   22      M    student  175.00
3   paul   58      F    manager  172.25
4  peter   33      M   engineer  172.25
5  julie   44      F  scientist  169.00

In [137]:
df = merge_left.copy()
median_height = df.height.median()
print (median_height)
df.fillna(median_height, inplace=True)
df

172.0

    name  age gender        job  height
0  alice   19      F    student   165.0
1   john   26      M    student   180.0
2   eric   22      M    student   175.0
3   paul   58      F    manager   172.0
4  peter   33      M   engineer   172.0
5  julie   44      F  scientist   169.0

In [143]:
df = merge_outer.copy()
df

       name   age gender        job  height
0     alice  19.0      F    student   165.0
1      john  26.0      M    student   180.0
2      eric  22.0      M    student   175.0
3      paul  58.0      F    manager     NaN
4     peter  33.0      M   engineer     NaN
5     julie  44.0      F  scientist   169.0
6  anderson   NaN    NaN        NaN   170.0

In [144]:
df.sort_values(by = "age", inplace=True, ignore_index=True)
df

       name   age gender        job  height
0     alice  19.0      F    student   165.0
1      eric  22.0      M    student   175.0
2      john  26.0      M    student   180.0
3     peter  33.0      M   engineer     NaN
4     julie  44.0      F  scientist   169.0
5      paul  58.0      F    manager     NaN
6  anderson   NaN    NaN        NaN   170.0

In [145]:
df.fillna(method="pad", inplace=True)   # forward fill
df

       name   age gender        job  height
0     alice  19.0      F    student   165.0
1      eric  22.0      M    student   175.0
2      john  26.0      M    student   180.0
3     peter  33.0      M   engineer   180.0
4     julie  44.0      F  scientist   169.0
5      paul  58.0      F    manager   169.0
6  anderson  58.0      F    manager   170.0

In [146]:
df = merge_outer.copy()
df

       name   age gender        job  height
0     alice  19.0      F    student   165.0
1      john  26.0      M    student   180.0
2      eric  22.0      M    student   175.0
3      paul  58.0      F    manager     NaN
4     peter  33.0      M   engineer     NaN
5     julie  44.0      F  scientist   169.0
6  anderson   NaN    NaN        NaN   170.0

In [148]:
df.sort_values(by = "name", inplace=True, ascending=False, ignore_index=True)
df

       name   age gender        job  height
0     peter  33.0      M   engineer     NaN
1      paul  58.0      F    manager     NaN
2     julie  44.0      F  scientist   169.0
3      john  26.0      M    student   180.0
4      eric  22.0      M    student   175.0
5  anderson   NaN    NaN        NaN   170.0
6     alice  19.0      F    student   165.0

In [149]:
df.fillna(method="bfill", inplace=True)   # backward fill
df

       name   age gender        job  height
0     peter  33.0      M   engineer   169.0
1      paul  58.0      F    manager   169.0
2     julie  44.0      F  scientist   169.0
3      john  26.0      M    student   180.0
4      eric  22.0      M    student   175.0
5  anderson  19.0      F    student   170.0
6     alice  19.0      F    student   165.0

### Rename Column Names

In [88]:
df = users.copy()
df

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [89]:
print (df.columns)
new_column_heads =  ['new_name', 'new_age', 'new_gender', 'new_job']
print (new_column_heads)
df.columns = new_column_heads
df

Index(['name', 'age', 'gender', 'job'], dtype='object')
['new_name', 'new_age', 'new_gender', 'new_job']

  new_name  new_age new_gender    new_job
0    alice       19          F    student
1     john       26          M    student
2     eric       22          M    student
3     paul       58          F    manager
4    peter       33          M   engineer
5    julie       44          F  scientist

In [90]:
df = users.copy()
df

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [91]:
df = df.rename(columns={'age':"new_age", 'job':'new_job', 'name':'new_name'})
df

  new_name  new_age gender    new_job
0    alice       19      F    student
1     john       26      M    student
2     eric       22      M    student
3     paul       58      F    manager
4    peter       33      M   engineer
5    julie       44      F  scientist

In [92]:
df = df.rename(columns={'new_age':"super_new_age"})
df

  new_name  super_new_age gender    new_job
0    alice             19      F    student
1     john             26      M    student
2     eric             22      M    student
3     paul             58      F    manager
4    peter             33      M   engineer
5    julie             44      F  scientist